<template lang="pug">
.home
  q-card.q-pa-md.q-mt-xl.q-mx-xl(flat bordered)
    q-card-section.row.justify-between
      .text-h6.text-grey-4.text-bold Скачать Counter-Strike 1.6 (CS 1.6)
    q-card-action
      q-btn(
        flat
        dense
        color="primary"
        label="Скачать"
        no-caps
        @click="download"
      )
    q-card-section.main-text.text-grey-4
      p.text-subtitle2.
        Counter-Strike 1.6 (CS 1.6) - это многопользовательская командная игра в жанре шутера от первого лица. Игроки делятся на две команды: террористов и контр-террористов. Цель террористов - разместить и взорвать бомбу, захватить заложников или уничтожить всю команду контр-террористов. Контр-террористы же стремятся предотвратить террористические акты, обезвредить бомбу или освободить заложников.
      p.text-subtitle2.
        Игра предлагает разнообразные карты, на которых происходят бои. Командный кооператив, тактическое планирование и точность стрельбы играют ключевую роль в достижении успеха. Каждая команда имеет доступ к различному оружию и снаряжению, которые можно приобрести за заработанные внутриигровые деньги. Игра также позволяет создавать и использовать свои собственные модификации и карты, что добавляет гибкость и возможность создания уникального игрового опыта.
      p.text-subtitle2.
        Counter-Strike 1.6 была одной из наиболее популярных онлайн-игр, ставшей символом эры первых онлайн-шутеров. Она предлагает интенсивные бои, стратегическую глубину и соревновательный характер, который продолжает привлекать множество игроков по всему миру.
</template>

<script>
import { defineComponent } from 'vue'

export default defineComponent({
  name: 'IndexPage',
  setup() {
    return {}
  }
})
</script>

<style lang="scss">
.home {
  .q-card {
    background: radial-gradient(circle, rgba(86, 88, 89, 0.78) 0%, rgba(44, 44, 44, 0.75) 100%)
  }
  .main-text {
    width: 70%
  }
}

</style>
